project_name/app/controllers/artworks_controller.rb

SELECT  "artworks".* FROM "artworks" WHERE "artworks"."id" = $1 LIMIT $2  [["id", nil], ["LIMIT", 1]]
---
    def index
        @artworks = Artwork.find(params[:user_id])

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
    def destroy
        @artwork = User.find(params[:id])